## Module 1: Data Processing
### Task 1
Here, I read the csv file into dataframe using pandas for the further analysis.

In [ ]:
import pandas as pd
df = pd.read_csv('nasa.csv')
df

### Task 2

Now i want to know the null values in the data

In [ ]:
df.isnull().sum()

### Task 3
Coming to this task, I will remove the row where the Alma_Mater column null value. Then, drop the rows where the Death_Mission is null and the Death date is not null.

In [ ]:
df.dropna(subset=['Alma_Mater'], inplace=True)
# Dropping rows where 'Death_mission' is null but 'Death_date' is present
df.drop(df[(df['Death_Mission'].isnull()) & (df['Death_Date'].notnull())].index, inplace=True)
df

### Task 4
Finally i export the dataframe to csv file for the SQL analysis.

In [ ]:
df.to_csv('astronauts.csv', index = False)

## Module 2
### Task 1: Data Download, Import, and Database Connection.

In [ ]:
# Download the dataset astronauts.csv which is exported in Module 1 - Task 4.
# Create the table on MYSQL.
# Use the %load_ext sql command to load the SQL extension in my Jupyter Notebook environment. This extension allows us to run SQL commands directly within your notebook.
# Use the %sql magic command to specify the connection string for your MySQL database.


# -- Load the sql extention ----
%load_ext sql

# --- Load your mysql db using credentials from the "DB" area ---
# I created the nasa database in the mysql there i uploaded the astronauts.csv file
%sql mysql+pymysql://root:@localhost/nasa

### Task 2
I retreived all the data

In [ ]:
%%sql
SELECT * FROM astronauts;

### Task 3
Find out the status of the astronaut.

In [ ]:
%%sql
SELECT Status, COUNT(*) AS Number
FROM astronauts
GROUP BY Status;

### Task 4
Find out the Military Branch of the astronaut.

In [ ]:
%%sql
SELECT Military_Branch, COUNT(*) AS Number
FROM astronauts
GROUP BY Military_Branch;

### Task 5
Find out the top 5 military ranks of the astronaut.

In [ ]:
%%sql
SELECT Military_Rank, COUNT(*) AS Number
FROM astronauts
GROUP BY Military_Rank
ORDER BY Number DESC
LIMIT 5;

### Task 6
Calculate the number of male and female astronauts.

In [ ]:
%%sql
SELECT Gender, COUNT(*) AS Number
FROM astronauts
GROUP BY Gender;

### Task 7
What is the average life expectancy of an astronaut?

In [ ]:
%%sql
SELECT ROUND(AVG(life_Expectancy),0) AS Average_Life_Expectancy
FROM(
SELECT
    CASE
        WHEN Status = 'Deceased' THEN Substring_index(Death_Date,'/',-1) - Substring_index(Birth_Date,'/',-1)
        WHEN Status != 'Deceased' THEN  2023 - Substring_index(Birth_Date,'/',-1)
    END AS life_Expectancy
 FROM astronauts
 ) AS Life_Expect;

### Task 8
What is the average life expectancy of a female astronaut?

In [ ]:
%%sql
SELECT ROUND(AVG(Female_life_Expectancy),0) AS Female_Average_Life_Expectancy
FROM(
SELECT
	CASE
		WHEN Status = 'Deceased' AND Gender ='Female' THEN Substring_index(Death_Date,'/',-1) - Substring_index(Birth_Date,'/',-1)
		WHEN Status != 'Deceased' AND Gender ='Female' THEN  2023 - Substring_index(Birth_Date,'/',-1)
    END AS Female_life_Expectancy
 FROM astronauts
 ) AS Life_Expect;

### Task 9
What is the average life expectancy of a male astronaut?

In [ ]:
%%sql

SELECT ROUND(AVG(Male_life_Expectancy),0) AS Male_Average_Life_Expectancy
FROM(
SELECT
	CASE
		WHEN Status = 'Deceased' AND Gender ='Male' THEN Substring_index(Death_Date,'/',-1) - Substring_index(Birth_Date,'/',-1)
		WHEN Status != 'Deceased' AND Gender ='Male' THEN  2023 - Substring_index(Birth_Date,'/',-1)
    END AS Male_life_Expectancy
 FROM astronauts
 ) AS Life_Expect;

### Task 10
Find out the top 10 educational backgrounds (graduates) that astronauts have.

In [ ]:
%%sql
SELECT Graduate_Major, COUNT(Graduate_Major) AS Number
FROM astronauts
GROUP BY Graduate_Major
ORDER BY Number DESC
LIMIT 10;

### Task 11
Calculate the count of astronauts with undergraduate and graduate degrees.

In [ ]:
%%sql
SELECT COUNT(*) AS Number_of_Astronauts,
COUNT(Undergraduate_Major) AS Astronauts_with_Undergraduate_Degrees,
COUNT(Graduate_Major)AS Astronauts_with_Graduate_Degrees
FROM astronauts;

### Task 12
Find out the top 5 countries/states from which astronauts come.

In [ ]:
%%sql
SELECT  Substring_index(Birth_Place,',',-1) AS STATE, Count(*) AS Number
FROM  astronauts
GROUP BY STAE
ORDER BY Number DESC
LIMIT 5;

### Task 13
Find out the average number of space flights and spacewalks for astronauts.

In [ ]:
%%sql
SELECT ROUND(AVG(Space_Flights),2) AS Average_Number_Of_Space_Flight , ROUND(AVG(Space_Walks),2) AS Average_Number_Of_Space_Walks
FROM astronauts;